driver-tests/bpelse/foreach-bpel20/ForEachJbi/test/forEach_seq2/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="http://stc.com/forEach_test">
  <soapenv:Body>
    <for:item>
      <for:value>1.2</for:value>
    </for:item>
  </soapenv:Body>
</soapenv:Envelope>