driver-tests/bpelse/foreach-bpel20/ForEachJbi/test/results/forEach_seq2/Actual_20130304134457_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/forEach_test" xmlns:msgns="http://stc.com/forEach_test">
      <value>5.2</value>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>